SteffenLav/qmx-panadapter/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_REV_MIN_0=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - HPI octal mode for Tab5
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# FreeRTOS
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Stacks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Cache
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
# Phase 2.1 - bump USB enum buffer for devices with large config descriptors (QMX has CDC + UAC)
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=2048

# v1.3 engineering-sample silicon needs 360MHz max (400MHz default fails clock init)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

CONFIG_LV_FONT_MONTSERRAT_48=y

CONFIG_LV_FONT_MONTSERRAT_32=y

# --------------------------------------------------------------------
# WiFi (ESP32-P4 via ESP32-C6 co-processor over SDIO using esp_hosted)
# Settings copied from N6HAN's qrp_companion which matches the Tab5
# factory C6 firmware (esp_hosted slave 1.4.0).
# --------------------------------------------------------------------
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=15
CONFIG_HTTPD_WS_SUPPORT=y

# LVGL memory pool -- bumped from default 64 KB to 128 KB to accommodate
# pre-built modals + drawer + 20-row FT8 pool (~110 KB cumulative).
# Pool is a .bss static array in internal SRAM; cost is 64 KB more internal RAM.
CONFIG_LV_MEM_SIZE_KILOBYTES=128


# Move LVGL static memory pool to PSRAM (.ext_ram.bss). Without this,
# the pool lives in internal SRAM (.bss) and steals DMA-capable memory
# from SDIO/USB. With PSRAM placement, the pool is effectively
# unlimited (28 MB free) and internal SRAM is preserved for DMA.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
